# Limpieza de datos

In [2]:
import pandas as pd
from pymongo import MongoClient
from dotenv import load_dotenv
import os

load_dotenv()

True

### Poblacion

In [3]:
df = pd.read_csv("../data/Data-csv/population.csv")
df.head()

,Year,District.Code,District.Name,Neighborhood.Code,Neighborhood.Name,Gender,Age,Number
0,2017,1,Ciutat Vella,1,el Raval,Male,0-4,224
1,2017,1,Ciutat Vella,2,el Barri Gòtic,Male,0-4,50
2,2017,1,Ciutat Vella,3,la Barceloneta,Male,0-4,43
3,2017,1,Ciutat Vella,4,"Sant Pere, Santa Caterina i la Ribera",Male,0-4,95
4,2017,2,Eixample,5,el Fort Pienc,Male,0-4,124

In [4]:
df.shape

(70080, 8)

In [5]:
df.columns

Index(['Year', 'District.Code', 'District.Name', 'Neighborhood.Code',
       'Neighborhood.Name', 'Gender', 'Age', 'Number'],
      dtype='object')

In [6]:
df.duplicated(['Year', 'District.Code', 'District.Name', 'Neighborhood.Code',
       'Neighborhood.Name', 'Gender', 'Age', 'Number']).sum()

4277

In [7]:
df[df.duplicated(subset=['Year', 'District.Code', 'District.Name', 'Neighborhood.Code',
       'Neighborhood.Name', 'Gender', 'Age', 'Number'], keep=False)].sort_values(by=['Neighborhood.Name']).head()

,Year,District.Code,District.Name,Neighborhood.Code,Neighborhood.Name,Gender,Age,Number
48602,2014,9,Sant Andreu,58,Baró de Viver,Male,85-89,3
20278,2016,9,Sant Andreu,58,Baró de Viver,Male,85-89,2
53274,2014,9,Sant Andreu,58,Baró de Viver,Female,55-59,16
38674,2015,9,Sant Andreu,58,Baró de Viver,Female,45-49,29
45171,2014,9,Sant Andreu,58,Baró de Viver,Male,40-44,23

In [16]:
df.isna().sum()

Year                 0
District.Code        0
District.Name        0
Neighborhood.Code    0
Neighborhood.Name    0
Gender               0
Age                  0
Number               0
dtype: int64

In [17]:
df = df.drop(columns=['District.Code', 'Neighborhood.Code'])

In [18]:
df.head()

,Year,District.Name,Neighborhood.Name,Gender,Age,Number
0,2017,Ciutat Vella,el Raval,Male,0-4,224
1,2017,Ciutat Vella,el Barri Gòtic,Male,0-4,50
2,2017,Ciutat Vella,la Barceloneta,Male,0-4,43
3,2017,Ciutat Vella,"Sant Pere, Santa Caterina i la Ribera",Male,0-4,95
4,2017,Eixample,el Fort Pienc,Male,0-4,124

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70080 entries, 0 to 70079
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Year               70080 non-null  int64
 1   District.Name      70080 non-null  object
 2   Neighborhood.Name  70080 non-null  object
 3   Gender             70080 non-null  object
 4   Age                70080 non-null  object
 5   Number             70080 non-null  int64
dtypes: int64(2), object(4)
memory usage: 3.2+ MB

In [27]:
df['Year']=df['Year'].astype('str')

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70080 entries, 0 to 70079
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Year               70080 non-null  object
 1   District.Name      70080 non-null  object
 2   Neighborhood.Name  70080 non-null  object
 3   Gender             70080 non-null  object
 4   Age                70080 non-null  object
 5   Number             70080 non-null  int64
dtypes: int64(1), object(5)
memory usage: 3.2+ MB

In [31]:
df.describe(include = 'object')

         Year District.Name Neighborhood.Name Gender    Age
count   70080         70080             70080  70080  70080
unique      5            10                73      2     20
top      2017    Nou Barris          el Raval   Male    0-4
freq    14016         12480               960  35040   3650

In [32]:
df.describe()

             Number
count  70080.000000
mean     114.844720
std       96.540389
min        0.000000
25%       43.000000
50%       92.000000
75%      162.000000
max      777.000000

In [35]:
number_zero = df[df["Number"] == 0].index
number_zero

Int64Index([  771,  1252,  4640,  4859,  5078,  5443,  5516,  5662,  6246,
             6319,
            ...
            67347, 67420, 67566, 69695, 69799, 69841, 69845, 69902, 69975,
            69980],
           dtype='int64', length=322)

In [45]:
df1 = df.drop(number_zero)
df1

,Year,District.Name,Neighborhood.Name,Gender,Age,Number
0,2017,Ciutat Vella,el Raval,Male,0-4,224
1,2017,Ciutat Vella,el Barri Gòtic,Male,0-4,50
2,2017,Ciutat Vella,la Barceloneta,Male,0-4,43
3,2017,Ciutat Vella,"Sant Pere, Santa Caterina i la Ribera",Male,0-4,95
4,2017,Eixample,el Fort Pienc,Male,0-4,124
...,...,...,...,...,...,...
70075,2013,Sant Martí,Diagonal Mar i el Front Marítim del Poblenou,Female,>=95,21
70076,2013,Sant Martí,el Besòs i el Maresme,Female,>=95,25
70077,2013,Sant Martí,Provençals del Poblenou,Female,>=95,31
70078,2013,Sant Martí,Sant Martí de Provençals,Female,>=95,38
70079,2013,Sant Martí,la Verneda i la Pau,Female,>=95,47

In [50]:
user = os.getenv("MONGO_USER")
password = os.getenv("MONGO_PASS")

In [51]:
url = f"mongodb+srv://{user}:{password}@databcn.ot3vw.mongodb.net/test"
client = MongoClient(url)
client

MongoClient(host=['databcn-shard-00-02.ot3vw.mongodb.net:27017', 'databcn-shard-00-01.ot3vw.mongodb.net:27017', 'databcn-shard-00-00.ot3vw.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, authsource='admin', replicaset='atlas-bnysob-shard-0', ssl=True)

In [52]:
db = client.get_database("databcn")
db

Database(MongoClient(host=['databcn-shard-00-02.ot3vw.mongodb.net:27017', 'databcn-shard-00-01.ot3vw.mongodb.net:27017', 'databcn-shard-00-00.ot3vw.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, authsource='admin', replicaset='atlas-bnysob-shard-0', ssl=True), 'databcn')

In [53]:
hola = df1.to_dict("index")
pob = [i for i in hola.values()]

In [54]:
db.poblacion.insert_many(pob)

### Desempleo

In [58]:
dfu = pd.read_csv("../data/Data-csv/unemployment.csv")
dfu.head()

,Year,Month,District Code,District Name,Neighborhood Code,Neighborhood Name,Gender,Demand_occupation,Number
0,2017,January,1,Ciutat Vella,1,el Raval,Male,Registered unemployed,2107
1,2017,January,1,Ciutat Vella,2,el Barri Gòtic,Male,Registered unemployed,538
2,2017,January,1,Ciutat Vella,3,la Barceloneta,Male,Registered unemployed,537
3,2017,January,1,Ciutat Vella,4,"Sant Pere, Santa Caterina i la Ribera",Male,Registered unemployed,741
4,2017,January,2,Eixample,5,el Fort Pienc,Male,Registered unemployed,630

In [59]:
dfu.shape

(14208, 9)

In [60]:
dfu.columns

Index(['Year', 'Month', 'District Code', 'District Name', 'Neighborhood Code',
       'Neighborhood Name', 'Gender', 'Demand_occupation', 'Number'],
      dtype='object')

In [61]:
dfu.duplicated(['Year', 'Month', 'District Code', 'District Name', 'Neighborhood Code',
       'Neighborhood Name', 'Gender', 'Demand_occupation', 'Number']).sum()

0

In [87]:
dfu.isna().sum()

Year                 0
Month                0
District Name        0
Neighborhood Name    0
Gender               0
Demand_occupation    0
Number               0
dtype: int64

In [90]:
dfu["Demand_occupation"].unique()

array(['Registered unemployed', 'Unemployment demand'], dtype=object)

In [72]:
dfu = dfu.drop(columns=['District Code', 'Neighborhood Code'])

In [73]:
dfu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14208 entries, 0 to 14207
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Year               14208 non-null  object
 1   Month              14208 non-null  object
 2   District Name      14208 non-null  object
 3   Neighborhood Name  14208 non-null  object
 4   Gender             14208 non-null  object
 5   Demand_occupation  14208 non-null  object
 6   Number             14208 non-null  int64
dtypes: int64(1), object(6)
memory usage: 777.1+ KB

In [75]:
dfu['Year']=dfu['Year'].astype('str')

In [78]:
df.describe(include = 'all')

         Year District.Name Neighborhood.Name Gender    Age        Number
count   70080         70080             70080  70080  70080  70080.000000
unique      5            10                73      2     20           NaN
top      2017    Nou Barris          el Raval   Male    0-4           NaN
freq    14016         12480               960  35040   3650           NaN
mean      NaN           NaN               NaN    NaN    NaN    114.844720
std       NaN           NaN               NaN    NaN    NaN     96.540389
min       NaN           NaN               NaN    NaN    NaN      0.000000
25%       NaN           NaN               NaN    NaN    NaN     43.000000
50%       NaN           NaN               NaN    NaN    NaN     92.000000
75%       NaN           NaN               NaN    NaN    NaN    162.000000
max       NaN           NaN               NaN    NaN    NaN    777.000000

In [80]:
number_ze = dfu[dfu["Number"] == 0].index
number_ze

Int64Index([  295,   591,  1183,  1479,  2071,  2663,  2959,  3699,  3847,
             4143,  4439,  4735,  7103,  7251,  7399,  7547,  7695,  7843,
             7991,  8139,  8287,  8435,  8583,  8731,  8879,  9027,  9323,
            10063, 10729, 10803, 10877, 11395, 11543, 11691, 11765, 12061,
            12135, 12283, 12653, 12875, 12949, 13319, 13615, 13985, 14207],
           dtype='int64')

In [82]:
dfu1 = dfu.drop(number_ze)
dfu1

,Year,Month,District Name,Neighborhood Name,Gender,Demand_occupation,Number
0,2017,January,Ciutat Vella,el Raval,Male,Registered unemployed,2107
1,2017,January,Ciutat Vella,el Barri Gòtic,Male,Registered unemployed,538
2,2017,January,Ciutat Vella,la Barceloneta,Male,Registered unemployed,537
3,2017,January,Ciutat Vella,"Sant Pere, Santa Caterina i la Ribera",Male,Registered unemployed,741
4,2017,January,Eixample,el Fort Pienc,Male,Registered unemployed,630
...,...,...,...,...,...,...,...
14202,2013,December,Sant Martí,Diagonal Mar i el Front Marítim del Poblenou,Female,Registered unemployed,458
14203,2013,December,Sant Martí,el Besòs i el Maresme,Female,Registered unemployed,1043
14204,2013,December,Sant Martí,Provençals del Poblenou,Female,Registered unemployed,738
14205,2013,December,Sant Martí,Sant Martí de Provençals,Female,Registered unemployed,1015
14206,2013,December,Sant Martí,la Verneda i la Pau,Female,Registered unemployed,1145

In [91]:
up = dfu1.to_dict("index")
des = [i for i in up.values()]

In [92]:
db.desempleo.insert_many(des)